zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA354/startup_MCXA354.cpp
WEAK void SPC0_IRQHandler(void)
{
    SPC0_DriverIRQHandler();
}

WEAK void Reserved33_IRQHandler(void)
{
    Reserved33_DriverIRQHandler();
}

WEAK void WUU0_IRQHandler(void)
{
    WUU0_DriverIRQHandler();
}

WEAK void CAN0_IRQHandler(void)
{
    CAN0_DriverIRQHandler();
}

WEAK void Reserved36_IRQHandler(void)
{
    Reserved36_DriverIRQHandler();
}

WEAK void Reserved37_IRQHandler(void)
{
    Reserved37_DriverIRQHandler();
}

WEAK void Reserved38_IRQHandler(void)
{
    Reserved38_DriverIRQHandler();
}

WEAK void Reserved39_IRQHandler(void)
{
    Reserved39_DriverIRQHandler();
}

WEAK void Reserved40_IRQHandler(void)
{
    Reserved40_DriverIRQHandler();
}

WEAK void Reserved41_IRQHandler(void)
{
    Reserved41_DriverIRQHandler();
}

WEAK void LPI2C0_IRQHandler(void)
{
    LPI2C0_DriverIRQHandler();
}

WEAK void LPI2C1_IRQHandler(void)
{
    LPI2C1_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{
    LPSPI0_DriverIRQHandler();
}

WEAK void LPSPI1_IRQHandler(void)
{
    LPSPI1_DriverIRQHandler();
}

WEAK void Reserved46_IRQHandler(void)
{
    Reserved46_DriverIRQHandler();
}

WEAK void LPUART0_IRQHandler(void)
{
    LPUART0_DriverIRQHandler();
}

WEAK void LPUART1_IRQHandler(void)
{
    LPUART1_DriverIRQHandler();
}

WEAK void LPUART2_IRQHandler(void)
{
    LPUART2_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{
    LPUART3_DriverIRQHandler();
}

WEAK void Reserved51_IRQHandler(void)
{
    Reserved51_DriverIRQHandler();
}

WEAK void Reserved52_IRQHandler(void)
{
    Reserved52_DriverIRQHandler();
}

WEAK void Reserved53_IRQHandler(void)
{
    Reserved53_DriverIRQHandler();
}

WEAK void CDOG0_IRQHandler(void)
{
    CDOG0_DriverIRQHandler();
}

WEAK void CTIMER0_IRQHandler(void)
{
    CTIMER0_DriverIRQHandler();
}

WEAK void CTIMER1_IRQHandler(void)
{
    CTIMER1_DriverIRQHandler();
}

WEAK void CTIMER2_IRQHandler(void)
{
    CTIMER2_DriverIRQHandler();
}

WEAK void Reserved58_IRQHandler(void)
{
    Reserved58_DriverIRQHandler();
}

WEAK void Reserved59_IRQHandler(void)
{
    Reserved59_DriverIRQHandler();
}

WEAK void FLEXPWM0_RELOAD_ERROR_IRQHandler(void)
{
    FLEXPWM0_RELOAD_ERROR_DriverIRQHandler();
}

WEAK void FLEXPWM0_FAULT_IRQHandler(void)
{
    FLEXPWM0_FAULT_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE0_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE0_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE1_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE1_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE2_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE2_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE3_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE3_DriverIRQHandler();
}

WEAK void EQDC0_COMPARE_IRQHandler(void)
{
    EQDC0_COMPARE_DriverIRQHandler();
}

WEAK void EQDC0_HOME_IRQHandler(void)
{
    EQDC0_HOME_DriverIRQHandler();
}

WEAK void EQDC0_WATCHDOG_IRQHandler(void)
{
    EQDC0_WATCHDOG_DriverIRQHandler();
}

WEAK void EQDC0_INDEX_IRQHandler(void)
{
    EQDC0_INDEX_DriverIRQHandler();
}

WEAK void FREQME0_IRQHandler(void)
{
    FREQME0_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{
    LPTMR0_DriverIRQHandler();
}

WEAK void Reserved72_IRQHandler(void)
{
    Reserved72_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{
    OS_EVENT_DriverIRQHandler();
}

WEAK void WAKETIMER0_IRQHandler(void)
{
    WAKETIMER0_DriverIRQHandler();
}

WEAK void UTICK0_IRQHandler(void)
{
    UTICK0_DriverIRQHandler();
}

WEAK void WWDT0_IRQHandler(void)
{
    WWDT0_DriverIRQHandler();
}

WEAK void Reserved77_IRQHandler(void)
{
    Reserved77_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
    CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
    CMP1_DriverIRQHandler();
}

WEAK void CMP2_IRQHandler(void)
{
    CMP2_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{
    Reserved83_DriverIRQHandler();
}

WEAK void Reserved84_IRQHandler(void)
{
    Reserved84_DriverIRQHandler();
}

WEAK void Reserved85_IRQHandler(void)
{
    Reserved85_DriverIRQHandler();
}

WEAK void Reserved86_IRQHandler(void)
{
    Reserved86_DriverIRQHandler();
}

WEAK void GPIO0_IRQHandler(void)
{
    GPIO0_DriverIRQHandler();
}

WEAK void GPIO1_IRQHandler(void)
{
    GPIO1_DriverIRQHandler();
}

WEAK void GPIO2_IRQHandler(void)
{
    GPIO2_DriverIRQHandler();
}

WEAK void GPIO3_IRQHandler(void)
{
    GPIO3_DriverIRQHandler();
}

WEAK void GPIO4_IRQHandler(void)
{
    GPIO4_DriverIRQHandler();
}

WEAK void Reserved92_IRQHandler(void)
{
    Reserved92_DriverIRQHandler();
}

WEAK void Reserved93_IRQHandler(void)
{
    Reserved93_DriverIRQHandler();
}

WEAK void Reserved94_IRQHandler(void)
{
    Reserved94_DriverIRQHandler();
}

WEAK void FLEXPWM1_RELOAD_ERROR_IRQHandler(void)
{
    FLEXPWM1_RELOAD_ERROR_DriverIRQHandler();
}

WEAK void FLEXPWM1_FAULT_IRQHandler(void)
{
    FLEXPWM1_FAULT_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE0_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE0_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE1_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE1_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE2_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE2_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE3_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE3_DriverIRQHandler();
}

WEAK void EQDC1_COMPARE_IRQHandler(void)
{
    EQDC1_COMPARE_DriverIRQHandler();
}

WEAK void EQDC1_HOME_IRQHandler(void)
{
    EQDC1_HOME_DriverIRQHandler();
}

WEAK void EQDC1_WATCHDOG_IRQHandler(void)
{
    EQDC1_WATCHDOG_DriverIRQHandler();
}

WEAK void EQDC1_INDEX_IRQHandler(void)
{
    EQDC1_INDEX_DriverIRQHandler();
}

WEAK void Reserved105_IRQHandler(void)
{
    Reserved105_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{
    Reserved106_DriverIRQHandler();
}

WEAK void Reserved107_IRQHandler(void)
{
    Reserved107_DriverIRQHandler();
}

WEAK void Reserved108_IRQHandler(void)
{
    Reserved108_DriverIRQHandler();
}

WEAK void Reserved109_IRQHandler(void)
{
    Reserved109_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

